jwt-test/app/controllers/api/v1/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO `posts` (`title`, `content`, `created_at`, `updated_at`) VALUES ('Mi primer post', 'Publicando mi primer post', '2024-03-20 02:24:09.134923', '2024-03-20 02:24:09.134923')