jwt-test/app/controllers/api/v1/sessions_controller.rb

    def login
        @user = User.find_by(username: params[:username])
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'gerardo' LIMIT 1

    def refresh
        refresh_token = params[:refresh_token]
        decoded_refresh_token = jwt_decode(refresh_token)

        if decoded_refresh_token
          user = User.find_by(id: decoded_refresh_token[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1