jwt-test/app/controllers/api/v1/users_controller.rb

INSERT INTO `users` (`username`, `password`, `isAdmin`, `created_at`, `updated_at`) VALUES ('gerardo', 'gerardo0908', NULL, '2024-03-20 02:43:34.908340', '2024-03-20 02:43:34.908340')
---
  def create
    @user = User.new(user_params)
    if @user.save

DELETE FROM `users` WHERE `users`.`id` = 3
---
  def destroy
    begin
      @user.destroy

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def set_user
    @user = User.find_by(id: params[:id])