jwt-test/app/controllers/application_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    def find_user_from_token(token)
      decoded_token = jwt_decode(token)
      User.find_by(id: decoded_token[:id]) if decoded_token